share/tutorials/incompressible/simple/air_foil_2d/0/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0.14;

boundaryField
{
  inlet
  {
    type            freestream;
    freestreamValue uniform 0.14;
  }
  outlet
  {
    type            freestream;
    freestreamValue uniform 0.14;
  }
  walls
  {
    type            nutUSpaldingWallFunction;
    value           uniform 0;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
